 // ======= Указатели и ссылки

 // Ссылки хранят программный адрес, и находят данную ячейку


 int num = 10;
 // int a = num; // в памяти я занимаю еще ОДНУ ячейку памяти, и это НЕ правльно 
//  int &a; // Ошибка!!
 int &a = num; // теперь переменная А хранит адрес переменной NUM


 a = 15; 

 cout << &num << " -- " << num << endl;
 cout << &a << " -- " << a << endl;



 // Указатели   
 // в названиях указателкй используют ptr в НАЧАЛЕ
 // ** указывают на программный адрес **

 int val = 12;
 // Создаем указатель, который указывает на такую ячейку как val
 int* ptrVal = &val;


 // Меняем значение переменной через УКАЗАТЕЛЬ
 *ptrVal = 20;

 ptrVal = nullptr; // ОЧИСТКА памяти указателя, ОН ПУСТ теперь

 cout << &val << " -- " << val << endl;
 cout << ptrVal << " -- " << *ptrVal << endl;
